# Index Dataframe

In [4]:
import pandas as pd

In [9]:
people = ['Sarah', 'Mike', 'Chrisna']
ages  =  [28, 32, 25]
survive = [True,False,False]
df = pd.DataFrame({'name' : pd.Series(people,index=['x','y','z']),
                'age'  : pd.Series(ages,index=['x','y','z']),
                'survived':pd.Series(survive,index=['x','y','z'])       
               })

In [10]:
df

      name  age  survived
x    Sarah   28      True
y     Mike   32     False
z  Chrisna   25     False

In [11]:
df['name']

x      Sarah
y       Mike
z    Chrisna
Name: name, dtype: object

In [17]:
df[['name','survived']]
#we shold use 2 barackets

      name  survived
x    Sarah      True
y     Mike     False
z  Chrisna     False

In [37]:
#we can not use here iloc
df.loc['y']

name         Mike
age            32
survived    False
Name: y, dtype: object

In [20]:
df['survived'] == 0

x    False
y     True
z     True
Name: survived, dtype: bool

In [19]:
df[df['survived'] == 0]

      name  age  survived
y     Mike   32     False
z  Chrisna   25     False

In [23]:
df['survived'][df['age'] > 30]

y    False
Name: survived, dtype: bool

In [24]:
data = {'year': [2010, 2011, 2012, 2011, 2012, 2010, 2011, 2012],
       'team': ['Bears', 'Bears', 'Bears', 'Packers', 'Packers', 'Lions',
                'Lions', 'Lions'],
        'wins': [11, 8, 10, 15, 11, 6, 10, 4],
        'losses': [5, 8, 6, 1, 5, 10, 6, 12]}
football = pd.DataFrame(data)

In [25]:
football

   year     team  wins  losses
0  2010    Bears    11       5
1  2011    Bears     8       8
2  2012    Bears    10       6
3  2011  Packers    15       1
4  2012  Packers    11       5
5  2010    Lions     6      10
6  2011    Lions    10       6
7  2012    Lions     4      12

In [26]:
football['year']

0    2010
1    2011
2    2012
3    2011
4    2012
5    2010
6    2011
7    2012
Name: year, dtype: int64

In [27]:
#shorthand for football['year']
football.year

0    2010
1    2011
2    2012
3    2011
4    2012
5    2010
6    2011
7    2012
Name: year, dtype: int64

In [28]:
football[['year', 'wins', 'losses']]

   year  wins  losses
0  2010    11       5
1  2011     8       8
2  2012    10       6
3  2011    15       1
4  2012    11       5
5  2010     6      10
6  2011    10       6
7  2012     4      12

In [38]:
#iloc is just for integers
football.iloc[[0]]

   year   team  wins  losses
0  2010  Bears    11       5

In [39]:
football.loc[[0]]

   year   team  wins  losses
0  2010  Bears    11       5

In [40]:
football[3:5]

   year     team  wins  losses
3  2011  Packers    15       1
4  2012  Packers    11       5

In [41]:
football[football.wins > 10]

   year     team  wins  losses
0  2010    Bears    11       5
3  2011  Packers    15       1
4  2012  Packers    11       5

In [45]:
football[(football.wins > 10) & (football.team == "Packers")]

   year     team  wins  losses
3  2011  Packers    15       1
4  2012  Packers    11       5